brew 'mas'

##
## Base
##

cask 'latest'
mas 'Bitwarden', id: 1352778147
mas 'Things 3', id: 904280696
cask 'thingsmacsandboxhelper'
mas 'Amphetamine', id: 937984704

##
## Desktop
##

mas 'Vimari', id: 1480933944
mas 'Wipr', id: 1320666476
cask 'hammerspoon'
cask 'contexts'
cask 'cursorcerer'
cask 'itsycal'
cask 'cpuinfo'
cask 'firefox'

##
## Dev
##

brew 'git'
brew 'vim'
brew 'fzy'
brew 'tmux'
brew 'bash'
brew 'bash-completion@2'
brew 'the_silver_searcher'
brew 'htop'
brew 'ncdu'
brew 'jq'
brew 'watch'
cask 'alacritty'
cask 'secure-pipes'
mas 'ToothFairy', id: 1191449274
mas 'Reeder', id: 1449412482

##
## Debuig
##

brew 'mtr'

##
## Work
##

mas 'Slack', id: 803453959
mas 'Bear', id: 1091189122
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Excel', id: 462058435
cask 'webex-teams'

##
## Work dev
##

brew 'azure-cli'

##
## Media
##

cask 'spotify'
cask 'mpv'
