##
## Base
##

brew 'mas'
cask 'latest'
cask 'app-cleaner'

##
## Desktop
##

cask 'hammerspoon'
cask 'contexts'
cask 'cursorcerer'

##
## Menubar
##

cask 'hiddenbar'
cask 'itsycal'
cask 'cpuinfo'
cask 'shifty'
mas 'Amphetamine', id: 937984704
mas 'ToothFairy', id: 1191449274

##
## Productivity
##

mas 'Things 3', id: 904280696

##
## Web
##

mas 'Vimari', id: 1480933944
mas 'Wipr', id: 1320666476
mas 'Bitwarden', id: 1352778147
mas 'Reeder', id: 1449412482

##
## Media
##

cask 'spotify'

##
## Dev
##

brew 'git'
brew 'vim'
brew 'fzy'
brew 'tmux'
brew 'bash'
brew 'bash-completion@2'
brew 'the_silver_searcher'
brew 'htop'
brew 'ncdu'
brew 'jq'
brew 'moreutils'
brew 'watch'
brew 'grip'
cask 'alacritty'

##
## Debug
##

brew 'mtr'

##
## Work
##

mas 'Slack', id: 803453959
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Excel', id: 462058435
mas 'OneDrive', id: 823766827
cask 'webex-teams'
mas 'Finances', id: 1218241304
tap 'homebrew/cask-drivers'
cask 'xerox-print-driver'
brew 'p7zip'
cask 'vmware-fusion'

##
## Work dev
##

brew 'azure-cli'
brew 'go'
