brew 'mas'

##
## Base
##

cask 'latest'
mas 'Bitwarden', id: 1352778147
mas 'Todoist', id: 585829637
mas 'Amphetamine', id: 937984704

##
## Desktop
##

mas 'Vimari', id: 1480933944
mas 'Wipr', id: 1320666476
cask 'hammerspoon'
cask 'contexts'
cask 'itsycal'
cask 'qutebrowser'

##
## Dev
##

brew 'git'
brew 'vim'
brew 'fzy'
brew 'tmux'
brew 'bash'
brew 'bash-completion@2'
brew 'the_silver_searcher'
brew 'htop'
brew 'ncdu'
brew 'jq'
cask 'alacritty'

##
## Work
##

mas 'Slack', id: 803453959
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Excel', id: 462058435
cask 'webex-teams'

##
## Media
##

cask 'plex'
cask 'spotify'
